# Built In Failures Rebar Failures Rebar Hook Over Crank Property

Source: https://www.revitapidocs.com/2026/2c4a1582-5e82-02e2-1f79-a3155a1d9d8a.htm

---

| Built In Failures Rebar Failures Rebar Hook Over Crank Property |
| --- |

Cannot add hook to the end that already has a crank.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarHookOverCrank { get; }
```

```
Public Shared ReadOnly Property RebarHookOverCrank As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarHookOverCrank {
	FailureDefinitionId^ get ();
}
```

```
static member RebarHookOverCrank : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace